event_list = ["졸업식", "종업식", "소풍", "입학식", "수학여행", "현장체험학습", "방학식", "겨울방학", "여름방학", "봄방학", "개학", "전시회", "실기대회",
              "미술대회", "수학올림피아드", "과학올림피아드", "신체검사", "예방접종", "수련회", "운동회", "견학", "답사", "민방위", "소방훈련", "개교기념일", "축제",
              "졸업장 수여식"]
event_list_en = ["Graduation Ceremony", "Closing Ceremony", "Excursion", "Entrance Ceremony", "School Trip",
                 "Field Experience Study", "Vacation", "Winter Vacation", "Summer Vacation", "Spring Break",
                 "Opening Ceremony", "Exhibition", "Practical Competition", "Art Competition",
                 "Mathematics Olympiad", "Science Olympiad", "Physical Examination", "Vaccination", "Retreat",
                 "Sports Day", "Field Trip", "Exploration", "Civil defense", "Fire drill", "Anniversary of school",
                 "Festival", "Diploma Award Ceremony"]
event_list_th = ["พิธีสำเร็จการศึกษา", "พิธีปิด", "ทัศนศึกษา", "พิธีรับเข้าเรียน", "ทัศนศึกษา",
                 "การศึกษาประสบการณ์ภาคสนาม",
                 "พิธีเช้า", "วันหยุดฤดูหนาว", "วันหยุดฤดูร้อน", "วันหยุดฤดูใบไม้ผลิ", "โรงเรียนเริ่มต้น", "นิทรรศการ",
                 "การแข่งขันภาคปฏิบัติ", "การประกวดศิลปะ", "คณิตศาสตร์โอลิมปิก", "วิทยาศาสตร์โอลิมปิก",
                 "การตรวจร่างกาย",
                 "การฉีดวัคซีน", "หนี", "วันกีฬาสี", "ทัศนศึกษา", "สำรวจ", "ป้องกันภัยพลเรือน", "ซ้อมดับเพลิง",
                 "ครบรอบโรงเรียน",
                 "เทศกาล", "พิธีรับปริญญา"]
event_list_km = ["ពិធីចែកសញ្ញាបត្រ", "ពិធីបិទ", "ដំណើរកំសាន្ត", "ពិធីចូលរៀន", "ការធ្វើដំណើរសាលា", "ការសិក្សាបទពិសោធន៍",
                 "ពិធីអាហារពេលព្រឹក", "វិស្សមកាលរដូវរងារ", "វិស្សមកាលរដូវក្តៅ", "សម្រាកនិទាឃរដូវ", "សាលាចាប់ផ្តើម",
                 "ការតាំងពិព័រណ៍",
                 "ការប្រកួតប្រជែងជាក់ស្តែង", "ការប្រកួតសិល្បៈ", "គណិតវិទ្យាអូឡាំពិក", "វិទ្យាសាស្ត្រអូឡាំព្យាដ",
                 "ការប្រឡងរាងកាយ",
                 "ការចាក់វ៉ាក់សាំង", "សម្រាក", "ទិវាកីឡា", "ការធ្វើដំណើរវាល។ ", "ការរុករក", "ការការពារស៊ីវិល",
                 "សមយុទ្ធអគ្គីភ័យ",
                 "ខួបនៃសាលារៀន", "ពិធីបុណ្យ", "ពិធីបញ្ចប់ការសិក្សា"]
event_list_vi = ["Lễ tốt nghiệp", "Lễ tổng kết", "Chuyến tham quan", "Lễ nhập học", "Chuyến đi học",
                 "Nghiên cứu trải nghiệm thực tế", "Lễ ăn sáng", "Kỳ nghỉ đông", "Kỳ nghỉ hè", "Kỳ nghỉ xuân",
                 "Khai giảng", "Triển lãm", "Cuộc thi thực hành", "Cuộc thi nghệ thuật", "Olympic Toán học",
                 "Olympic Khoa học", "Kiểm tra thể chất", "Tiêm phòng", "Khóa tu", "Ngày hội thể thao",
                 "Chuyến dã ngoại ", " Khám phá ", " Phòng thủ dân sự ", " Diễn tập chữa cháy ",
                 " Lễ kỷ niệm thành lập trường ", " Lễ hội ", " Lễ tốt nghiệp "]
event_list_ja = ["卒業式", "従業式", "ピクニック", "入学式", "修学旅行", "現場体験学習", "方程式", "冬休み", "夏休み", "春休み",
                 "開校", "展示会", "実技大会", "美術大会", "数学オリンピアード", "科学オリンピアド", "身体検査", "予防接種",
                 "修練会", "運動会", "見学", "回答", "民防衛", "消防訓練", "開校記念日", "祭り", "卒業場授与式"]
event_list_zh = ["毕业典礼", "结业典礼", "远足", "入学典礼", "学校旅行", "实地体验学习", "早餐仪式", "寒假", "暑假", "春假",
                 "开学", "展览", "实践比赛", "艺术竞赛", "数学奥林匹克", "科学奥林匹克", "体格检查", "疫苗接种", "撤退",
                 "运动项目", "实地考察", "探索", "民防", "消防演习", "奠基日", "节日", "毕业典礼"]
